Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KL402.h
extern volatile ECCP1ASBITS ECCP1ASbits __attribute__((__sfr__));

#define PSTR1CON PSTR1CON
extern volatile unsigned int  PSTR1CON __attribute__((__sfr__));
__extension__ typedef struct tagPSTR1CONBITS {
  union {
    struct {
      unsigned STRA:1;
      unsigned STRB:1;
      unsigned STRC:1;
      unsigned STRD:1;
      unsigned STRSYNC:1;
      unsigned :1;
      unsigned CMPL:2;
    };
    struct {
      unsigned :6;
      unsigned CMPL0:1;
      unsigned CMPL1:1;
    };
  };
} PSTR1CONBITS;
extern volatile PSTR1CONBITS PSTR1CONbits __attribute__((__sfr__));

#define CCP2CON CCP2CON
extern volatile unsigned int  CCP2CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CONBITS {
  union {
    struct {
      unsigned CCPM:4;
      unsigned DCB:2;
    };
    struct {
      unsigned CCPM0:1;
      unsigned CCPM1:1;
      unsigned CCPM2:1;
      unsigned CCPM3:1;
      unsigned DCB0:1;
      unsigned DCB1:1;
    };
    struct {
      unsigned CCP2M:4;
      unsigned DC2B:2;
    };
    struct {
      unsigned CCP2M0:1;
      unsigned CCP2M1:1;
      unsigned CCP2M2:1;
      unsigned CCP2M3:1;
      unsigned DC2B0:1;
      unsigned DC2B1:1;
    };
  };
} CCP2CONBITS;
extern volatile CCP2CONBITS CCP2CONbits __attribute__((__sfr__));

#define CCPR2L CCPR2L
extern volatile unsigned char CCPR2L __attribute__((__sfr__));
#define CCPR2H CCPR2H
extern volatile unsigned char CCPR2H __attribute__((__sfr__));
#define CCP3CON CCP3CON
extern volatile unsigned int  CCP3CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CONBITS {
  union {
    struct {
      unsigned CCPM:4;
      unsigned DCB:2;
    };
    struct {
      unsigned CCPM0:1;
      unsigned CCPM1:1;
      unsigned CCPM2:1;
      unsigned CCPM3:1;
      unsigned DCB0:1;
      unsigned DCB1:1;
    };
    struct {
      unsigned CCP3M:4;
      unsigned DC3B:2;
    };
    struct {
      unsigned CCP3M0:1;
      unsigned CCP3M1:1;
      unsigned CCP3M2:1;
      unsigned CCP3M3:1;
      unsigned DC3B0:1;
      unsigned DC3B1:1;
    };
  };
} CCP3CONBITS;
extern volatile CCP3CONBITS CCP3CONbits __attribute__((__sfr__));

#define CCPR3L CCPR3L
extern volatile unsigned char CCPR3L __attribute__((__sfr__));
#define CCPR3H CCPR3H
extern volatile unsigned char CCPR3H __attribute__((__sfr__));
#define SPI1BUF SPI1BUF
extern volatile unsigned int  SPI1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFBITS {
  union {
    struct {
      unsigned SSPBUF:8;
    };
    struct {
      unsigned SPI1BUF:8;
    };
  };
} SPI1BUFBITS;
extern volatile SPI1BUFBITS SPI1BUFbits __attribute__((__sfr__));

#define SSP1BUF SSP1BUF
extern volatile unsigned int  SSP1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSSP1BUFBITS {
  union {
    struct {
      unsigned SSPBUF:8;
    };
    struct {
      unsigned SPI1BUF:8;
    };
  };
} SSP1BUFBITS;
extern volatile SSP1BUFBITS SSP1BUFbits __attribute__((__sfr__));

#define SSP1CON1 SSP1CON1
extern volatile unsigned int  SSP1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON1BITS {
  union {
    struct {
      unsigned SSPM:4;
      unsigned CKP:1;
      unsigned SSPEN:1;
      unsigned SSPOV:1;
      unsigned WCOL:1;
    };
    struct {
      unsigned SSPM0:1;
      unsigned SSPM1:1;
      unsigned SSPM2:1;
      unsigned SSPM3:1;
    };
  };
} SSP1CON1BITS;
extern volatile SSP1CON1BITS SSP1CON1bits __attribute__((__sfr__));

#define SSP1CON2 SSP1CON2
extern volatile unsigned int  SSP1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON2BITS {
  union {
    struct {
      unsigned SEN:1;
      unsigned RSEN:1;
      unsigned PEN:1;
      unsigned RCEN:1;
      unsigned ACKEN:1;
      unsigned ACKDT:1;
      unsigned ACKSTAT:1;
      unsigned GCEN:1;
    };
    struct {
      unsigned :1;
      unsigned ADMSK:5;
    };
    struct {
      unsigned :1;
      unsigned ADMSK1:1;
      unsigned ADMSK2:1;
      unsigned ADMSK3:1;
      unsigned ADMSK4:1;
      unsigned ADMSK5:1;
    };
  };
} SSP1CON2BITS;
extern volatile SSP1CON2BITS SSP1CON2bits __attribute__((__sfr__));

#define SSP1CON3 SSP1CON3
extern volatile unsigned int  SSP1CON3 __attribute__((__sfr__));
typedef struct tagSSP1CON3BITS {
  unsigned DHEN:1;
  unsigned AHEN:1;
  unsigned SBCDE:1;
  unsigned SDAHT:1;
  unsigned BOEN:1;
  unsigned SCIE:1;
  unsigned PCIE:1;
  unsigned ACKTIM:1;
} SSP1CON3BITS;
extern volatile SSP1CON3BITS SSP1CON3bits __attribute__((__sfr__));

#define SSP1STAT SSP1STAT
extern volatile unsigned int  SSP1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSSP1STATBITS {
  union {
    struct {
      unsigned BF:1;
      unsigned UA:1;
      unsigned R_NOT_W:1;
      unsigned S:1;
      unsigned P:1;
      unsigned D_NOT_A:1;
      unsigned CKE:1;
      unsigned SMP:1;
    };
    struct {
      unsigned :2;
      unsigned R_W:1;
      unsigned :2;
      unsigned D_A:1;
    };
    struct {
      unsigned :2;
      unsigned NOT_W:1;
      unsigned :2;
      unsigned NOT_A:1;
    };
    struct {
      unsigned :2;
      unsigned NOT_WRITE:1;
      unsigned :2;
      unsigned NOT_ADDRESS:1;
    };
    struct {
      unsigned :2;
      unsigned READ_WRITE:1;
      unsigned :2;
      unsigned DATA_ADDRESS:1;
    };
    struct {
      unsigned :2;
      unsigned I2C_READ:1;
      unsigned I2C_START:1;
      unsigned I2C_STOP:1;
      unsigned I2C_DAT:1;
    };
  };
} SSP1STATBITS;
extern volatile SSP1STATBITS SSP1STATbits __attribute__((__sfr__));

#define I2C1ADD I2C1ADD
extern volatile unsigned int  I2C1ADD __attribute__((__sfr__));
__extension__ typedef struct tagI2C1ADDBITS {
  union {
    struct {
      unsigned SSPADD:8;
    };
    struct {
      unsigned I2CADD:8;
    };
  };
} I2C1ADDBITS;
extern volatile I2C1ADDBITS I2C1ADDbits __attribute__((__sfr__));

#define SSP1ADD SSP1ADD
extern volatile unsigned int  SSP1ADD __attribute__((__sfr__));
__extension__ typedef struct tagSSP1ADDBITS {
  union {
    struct {
      unsigned SSPADD:8;
    };
    struct {
      unsigned I2CADD:8;
    };
  };
} SSP1ADDBITS;
extern volatile SSP1ADDBITS SSP1ADDbits __attribute__((__sfr__));

#define I2C1MSK I2C1MSK
extern volatile unsigned int  I2C1MSK __attribute__((__sfr__));
__extension__ typedef struct tagI2C1MSKBITS {
  union {
    struct {
      unsigned MSK0:1;
      unsigned MSK1:1;
      unsigned MSK2:1;
      unsigned MSK3:1;
      unsigned MSK4:1;
      unsigned MSK5:1;
      unsigned MSK6:1;
      unsigned MSK7:1;
    };
    struct {
      unsigned AMSK:8;
    };
  };
} I2C1MSKBITS;
