Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KL402.h
extern volatile REFOCONBITS REFOCONbits __attribute__((__sfr__));

#define HLVDCON HLVDCON
extern volatile unsigned int  HLVDCON __attribute__((__sfr__));
__extension__ typedef struct tagHLVDCONBITS {
  union {
    struct {
      unsigned HLVDL:4;
      unsigned :1;
      unsigned IRVST:1;
      unsigned BGVST:1;
      unsigned VDIR:1;
      unsigned :5;
      unsigned HLSIDL:1;
      unsigned :1;
      unsigned HLVDEN:1;
    };
    struct {
      unsigned HLVDL0:1;
      unsigned HLVDL1:1;
      unsigned HLVDL2:1;
      unsigned HLVDL3:1;
    };
  };
} HLVDCONBITS;
extern volatile HLVDCONBITS HLVDCONbits __attribute__((__sfr__));

#define NVMCON NVMCON
extern volatile unsigned int  NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      unsigned NVMOP:6;
      unsigned ERASE:1;
      unsigned :5;
      unsigned PGMONLY:1;
      unsigned WRERR:1;
      unsigned WREN:1;
      unsigned WR:1;
    };
    struct {
      unsigned NVMOP0:1;
      unsigned NVMOP1:1;
      unsigned NVMOP2:1;
      unsigned NVMOP3:1;
      unsigned NVMOP4:1;
      unsigned NVMOP5:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile unsigned int  NVMKEY __attribute__((__sfr__));
__extension__ typedef struct tagNVMKEYBITS {
  union {
    struct {
      unsigned NVMKEY:8;
    };
    struct {
      unsigned NVMKEY0:1;
      unsigned NVMKEY1:1;
      unsigned NVMKEY2:1;
      unsigned NVMKEY3:1;
      unsigned NVMKEY4:1;
      unsigned NVMKEY5:1;
      unsigned NVMKEY6:1;
      unsigned NVMKEY7:1;
    };
  };
} NVMKEYBITS;
extern volatile NVMKEYBITS NVMKEYbits __attribute__((__sfr__));

#define ULPWCON ULPWCON
extern volatile unsigned int  ULPWCON __attribute__((__sfr__));
__extension__ typedef struct tagULPWCONBITS {
  union {
    struct {
      unsigned :8;
      unsigned ULPSINK:1;
      unsigned :4;
      unsigned ULPSIDL:1;
      unsigned :1;
      unsigned ULPEN:1;
    };
    struct {
      unsigned :8;
      unsigned CRNTEN:1;
      unsigned :4;
      unsigned PSIDL:1;
      unsigned :1;
      unsigned WUEN:1;
    };
  };
} ULPWCONBITS;
extern volatile ULPWCONBITS ULPWCONbits __attribute__((__sfr__));

#define PMD1 PMD1
extern volatile unsigned int  PMD1 __attribute__((__sfr__));
__extension__ typedef struct tagPMD1BITS {
  union {
    struct {
      unsigned ADC1MD:1;
      unsigned :4;
      unsigned U1MD:1;
      unsigned U2MD:1;
      unsigned SSP1MD:1;
      unsigned :3;
      unsigned T1MD:1;
      unsigned T2MD:1;
      unsigned T3MD:1;
      unsigned T4MD:1;
    };
    struct {
      unsigned ADCMD:1;
      unsigned :6;
      unsigned I2C1MD:1;
    };
    struct {
      unsigned :7;
      unsigned SPI1MD:1;
    };
  };
} PMD1BITS;
extern volatile PMD1BITS PMD1bits __attribute__((__sfr__));

#define PMDIS1 PMDIS1
extern volatile unsigned int  PMDIS1 __attribute__((__sfr__));
__extension__ typedef struct tagPMDIS1BITS {
  union {
    struct {
      unsigned ADC1MD:1;
      unsigned :4;
      unsigned U1MD:1;
      unsigned U2MD:1;
      unsigned SSP1MD:1;
      unsigned :3;
      unsigned T1MD:1;
      unsigned T2MD:1;
      unsigned T3MD:1;
      unsigned T4MD:1;
    };
    struct {
      unsigned ADCMD:1;
      unsigned :6;
      unsigned I2C1MD:1;
    };
    struct {
      unsigned :7;
      unsigned SPI1MD:1;
    };
  };
} PMDIS1BITS;
extern volatile PMDIS1BITS PMDIS1bits __attribute__((__sfr__));

#define PMD2 PMD2
extern volatile unsigned int  PMD2 __attribute__((__sfr__));
typedef struct tagPMD2BITS {
  unsigned CCP1MD:1;
  unsigned CCP2MD:1;
  unsigned CCP3MD:1;
} PMD2BITS;
extern volatile PMD2BITS PMD2bits __attribute__((__sfr__));

#define PMDIS2 PMDIS2
extern volatile unsigned int  PMDIS2 __attribute__((__sfr__));
typedef struct tagPMDIS2BITS {
  unsigned CCP1MD:1;
  unsigned CCP2MD:1;
  unsigned CCP3MD:1;
} PMDIS2BITS;
extern volatile PMDIS2BITS PMDIS2bits __attribute__((__sfr__));

#define PMD3 PMD3
extern volatile unsigned int  PMD3 __attribute__((__sfr__));
__extension__ typedef struct tagPMD3BITS {
  union {
    struct {
      unsigned :1;
      unsigned SSP2MD:1;
      unsigned :8;
      unsigned CMPMD:1;
    };
    struct {
      unsigned :1;
      unsigned I2C2MD:1;
    };
    struct {
      unsigned :1;
      unsigned SPI2MD:1;
    };
  };
} PMD3BITS;
extern volatile PMD3BITS PMD3bits __attribute__((__sfr__));

#define PMDIS3 PMDIS3
extern volatile unsigned int  PMDIS3 __attribute__((__sfr__));
__extension__ typedef struct tagPMDIS3BITS {
  union {
    struct {
      unsigned :1;
      unsigned SSP2MD:1;
      unsigned :8;
      unsigned CMPMD:1;
    };
    struct {
      unsigned :1;
      unsigned I2C2MD:1;
    };
    struct {
      unsigned :1;
      unsigned SPI2MD:1;
    };
  };
} PMDIS3BITS;
extern volatile PMDIS3BITS PMDIS3bits __attribute__((__sfr__));

#define PMD4 PMD4
extern volatile unsigned int  PMD4 __attribute__((__sfr__));
typedef struct tagPMD4BITS {
  unsigned :1;
  unsigned HLVDMD:1;
  unsigned :1;
  unsigned REFOMD:1;
  unsigned EEMD:1;
  unsigned :2;
  unsigned ULPWUMD:1;
} PMD4BITS;
extern volatile PMD4BITS PMD4bits __attribute__((__sfr__));

#define PMDIS4 PMDIS4
extern volatile unsigned int  PMDIS4 __attribute__((__sfr__));
typedef struct tagPMDIS4BITS {
  unsigned :1;
  unsigned HLVDMD:1;
  unsigned :1;
  unsigned REFOMD:1;
  unsigned EEMD:1;
  unsigned :2;
  unsigned ULPWUMD:1;
} PMDIS4BITS;
extern volatile PMDIS4BITS PMDIS4bits __attribute__((__sfr__));



/* ---------------------------------------------------------- */
/* Defines for unique SFR bit names                           */
/* ---------------------------------------------------------- */

/* SR */
#define _C SRbits.C
#define _Z SRbits.Z
#define _OV SRbits.OV
#define _N SRbits.N
#define _RA SRbits.RA
#define _IPL SRbits.IPL
#define _DC SRbits.DC
#define _IPL0 SRbits.IPL0
#define _IPL1 SRbits.IPL1
#define _IPL2 SRbits.IPL2

/* CORCON */
#define _PSV CORCONbits.PSV
#define _IPL3 CORCONbits.IPL3

/* CNPD1 */
#define _CN0PDE CNPD1bits.CN0PDE
#define _CN1PDE CNPD1bits.CN1PDE
#define _CN2PDE CNPD1bits.CN2PDE
#define _CN3PDE CNPD1bits.CN3PDE
#define _CN4PDE CNPD1bits.CN4PDE
#define _CN5PDE CNPD1bits.CN5PDE
#define _CN6PDE CNPD1bits.CN6PDE
#define _CN7PDE CNPD1bits.CN7PDE
#define _CN8PDE CNPD1bits.CN8PDE
#define _CN9PDE CNPD1bits.CN9PDE
#define _CN11PDE CNPD1bits.CN11PDE
#define _CN12PDE CNPD1bits.CN12PDE
#define _CN13PDE CNPD1bits.CN13PDE
#define _CN14PDE CNPD1bits.CN14PDE
#define _CN15PDE CNPD1bits.CN15PDE

