Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KL402.h
#define _T3CON_TMR3CS_POSITION                   0x00000006
#define _T3CON_TMR3CS_MASK                       0x000000C0
#define _T3CON_TMR3CS_LENGTH                     0x00000002

#define _T3CON_TON_POSITION                      0x00000000
#define _T3CON_TON_MASK                          0x00000001
#define _T3CON_TON_LENGTH                        0x00000001

#define _T3CON_NOT_TSYNC_POSITION                0x00000002
#define _T3CON_NOT_TSYNC_MASK                    0x00000004
#define _T3CON_NOT_TSYNC_LENGTH                  0x00000001

#define _T3CON_SOSCEN_POSITION                   0x00000003
#define _T3CON_SOSCEN_MASK                       0x00000008
#define _T3CON_SOSCEN_LENGTH                     0x00000001

#define _T3CON_TCKPS_POSITION                    0x00000004
#define _T3CON_TCKPS_MASK                        0x00000030
#define _T3CON_TCKPS_LENGTH                      0x00000002

#define _T3CON_TCS_POSITION                      0x00000006
#define _T3CON_TCS_MASK                          0x000000C0
#define _T3CON_TCS_LENGTH                        0x00000002

#define _T3CON_T3CKPS0_POSITION                  0x00000004
#define _T3CON_T3CKPS0_MASK                      0x00000010
#define _T3CON_T3CKPS0_LENGTH                    0x00000001

#define _T3CON_T3CKPS1_POSITION                  0x00000005
#define _T3CON_T3CKPS1_MASK                      0x00000020
#define _T3CON_T3CKPS1_LENGTH                    0x00000001

#define _T3CON_TMR3CS0_POSITION                  0x00000006
#define _T3CON_TMR3CS0_MASK                      0x00000040
#define _T3CON_TMR3CS0_LENGTH                    0x00000001

#define _T3CON_TMR3CS1_POSITION                  0x00000007
#define _T3CON_TMR3CS1_MASK                      0x00000080
#define _T3CON_TMR3CS1_LENGTH                    0x00000001

#define _T4CON_T4CKPS_POSITION                   0x00000000
#define _T4CON_T4CKPS_MASK                       0x00000003
#define _T4CON_T4CKPS_LENGTH                     0x00000002

#define _T4CON_TMR4ON_POSITION                   0x00000002
#define _T4CON_TMR4ON_MASK                       0x00000004
#define _T4CON_TMR4ON_LENGTH                     0x00000001

#define _T4CON_T4OUTPS_POSITION                  0x00000003
#define _T4CON_T4OUTPS_MASK                      0x00000078
#define _T4CON_T4OUTPS_LENGTH                    0x00000004

#define _T4CON_TCKPS_POSITION                    0x00000000
#define _T4CON_TCKPS_MASK                        0x00000003
#define _T4CON_TCKPS_LENGTH                      0x00000002

#define _T4CON_TON_POSITION                      0x00000002
#define _T4CON_TON_MASK                          0x00000004
#define _T4CON_TON_LENGTH                        0x00000001

#define _T4CON_TOUTPS_POSITION                   0x00000003
#define _T4CON_TOUTPS_MASK                       0x00000078
#define _T4CON_TOUTPS_LENGTH                     0x00000004

#define _T4CON_T4CKPS0_POSITION                  0x00000000
#define _T4CON_T4CKPS0_MASK                      0x00000001
#define _T4CON_T4CKPS0_LENGTH                    0x00000001

#define _T4CON_T4CKPS1_POSITION                  0x00000001
#define _T4CON_T4CKPS1_MASK                      0x00000002
#define _T4CON_T4CKPS1_LENGTH                    0x00000001

#define _T4CON_T4OUTPS0_POSITION                 0x00000003
#define _T4CON_T4OUTPS0_MASK                     0x00000008
#define _T4CON_T4OUTPS0_LENGTH                   0x00000001

#define _T4CON_T4OUTPS1_POSITION                 0x00000004
#define _T4CON_T4OUTPS1_MASK                     0x00000010
#define _T4CON_T4OUTPS1_LENGTH                   0x00000001

#define _T4CON_T4OUTPS2_POSITION                 0x00000005
#define _T4CON_T4OUTPS2_MASK                     0x00000020
#define _T4CON_T4OUTPS2_LENGTH                   0x00000001

#define _T4CON_T4OUTPS3_POSITION                 0x00000006
#define _T4CON_T4OUTPS3_MASK                     0x00000040
#define _T4CON_T4OUTPS3_LENGTH                   0x00000001

#define _CCPTMRS0_C1TSEL0_POSITION               0x00000000
#define _CCPTMRS0_C1TSEL0_MASK                   0x00000001
#define _CCPTMRS0_C1TSEL0_LENGTH                 0x00000001

#define _CCPTMRS0_C2TSEL0_POSITION               0x00000003
#define _CCPTMRS0_C2TSEL0_MASK                   0x00000008
#define _CCPTMRS0_C2TSEL0_LENGTH                 0x00000001

#define _CCPTMRS0_C3TSEL0_POSITION               0x00000006
#define _CCPTMRS0_C3TSEL0_MASK                   0x00000040
#define _CCPTMRS0_C3TSEL0_LENGTH                 0x00000001

#define _CCP1CON_CCPM_POSITION                   0x00000000
#define _CCP1CON_CCPM_MASK                       0x0000000F
#define _CCP1CON_CCPM_LENGTH                     0x00000004

#define _CCP1CON_DCB_POSITION                    0x00000004
#define _CCP1CON_DCB_MASK                        0x00000030
#define _CCP1CON_DCB_LENGTH                      0x00000002

#define _CCP1CON_PM_POSITION                     0x00000006
#define _CCP1CON_PM_MASK                         0x000000C0
#define _CCP1CON_PM_LENGTH                       0x00000002

#define _CCP1CON_CCPM0_POSITION                  0x00000000
#define _CCP1CON_CCPM0_MASK                      0x00000001
#define _CCP1CON_CCPM0_LENGTH                    0x00000001

#define _CCP1CON_CCPM1_POSITION                  0x00000001
#define _CCP1CON_CCPM1_MASK                      0x00000002
#define _CCP1CON_CCPM1_LENGTH                    0x00000001

#define _CCP1CON_CCPM2_POSITION                  0x00000002
#define _CCP1CON_CCPM2_MASK                      0x00000004
#define _CCP1CON_CCPM2_LENGTH                    0x00000001

#define _CCP1CON_CCPM3_POSITION                  0x00000003
#define _CCP1CON_CCPM3_MASK                      0x00000008
#define _CCP1CON_CCPM3_LENGTH                    0x00000001

#define _CCP1CON_DCB0_POSITION                   0x00000004
#define _CCP1CON_DCB0_MASK                       0x00000010
#define _CCP1CON_DCB0_LENGTH                     0x00000001

#define _CCP1CON_DCB1_POSITION                   0x00000005
#define _CCP1CON_DCB1_MASK                       0x00000020
#define _CCP1CON_DCB1_LENGTH                     0x00000001

#define _CCP1CON_PM0_POSITION                    0x00000006
#define _CCP1CON_PM0_MASK                        0x00000040
#define _CCP1CON_PM0_LENGTH                      0x00000001

