Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KL402.h
#define _ECCP1DEL_PDC2_POSITION                  0x00000002
#define _ECCP1DEL_PDC2_MASK                      0x00000004
#define _ECCP1DEL_PDC2_LENGTH                    0x00000001

#define _ECCP1DEL_PDC3_POSITION                  0x00000003
#define _ECCP1DEL_PDC3_MASK                      0x00000008
#define _ECCP1DEL_PDC3_LENGTH                    0x00000001

#define _ECCP1DEL_PDC4_POSITION                  0x00000004
#define _ECCP1DEL_PDC4_MASK                      0x00000010
#define _ECCP1DEL_PDC4_LENGTH                    0x00000001

#define _ECCP1DEL_PDC5_POSITION                  0x00000005
#define _ECCP1DEL_PDC5_MASK                      0x00000020
#define _ECCP1DEL_PDC5_LENGTH                    0x00000001

#define _ECCP1DEL_PDC6_POSITION                  0x00000006
#define _ECCP1DEL_PDC6_MASK                      0x00000040
#define _ECCP1DEL_PDC6_LENGTH                    0x00000001

#define _ECCP1DEL_P1DC_POSITION                  0x00000000
#define _ECCP1DEL_P1DC_MASK                      0x0000007F
#define _ECCP1DEL_P1DC_LENGTH                    0x00000007

#define _ECCP1DEL_P1RSEN_POSITION                0x00000007
#define _ECCP1DEL_P1RSEN_MASK                    0x00000080
#define _ECCP1DEL_P1RSEN_LENGTH                  0x00000001

#define _ECCP1DEL_P1DC0_POSITION                 0x00000000
#define _ECCP1DEL_P1DC0_MASK                     0x00000001
#define _ECCP1DEL_P1DC0_LENGTH                   0x00000001

#define _ECCP1DEL_P1DC1_POSITION                 0x00000001
#define _ECCP1DEL_P1DC1_MASK                     0x00000002
#define _ECCP1DEL_P1DC1_LENGTH                   0x00000001

#define _ECCP1DEL_P1DC2_POSITION                 0x00000002
#define _ECCP1DEL_P1DC2_MASK                     0x00000004
#define _ECCP1DEL_P1DC2_LENGTH                   0x00000001

#define _ECCP1DEL_P1DC3_POSITION                 0x00000003
#define _ECCP1DEL_P1DC3_MASK                     0x00000008
#define _ECCP1DEL_P1DC3_LENGTH                   0x00000001

#define _ECCP1DEL_P1DC4_POSITION                 0x00000004
#define _ECCP1DEL_P1DC4_MASK                     0x00000010
#define _ECCP1DEL_P1DC4_LENGTH                   0x00000001

#define _ECCP1DEL_P1DC5_POSITION                 0x00000005
#define _ECCP1DEL_P1DC5_MASK                     0x00000020
#define _ECCP1DEL_P1DC5_LENGTH                   0x00000001

#define _ECCP1DEL_P1DC6_POSITION                 0x00000006
#define _ECCP1DEL_P1DC6_MASK                     0x00000040
#define _ECCP1DEL_P1DC6_LENGTH                   0x00000001

#define _PWM1CON_PDC_POSITION                    0x00000000
#define _PWM1CON_PDC_MASK                        0x0000007F
#define _PWM1CON_PDC_LENGTH                      0x00000007

#define _PWM1CON_PRSEN_POSITION                  0x00000007
#define _PWM1CON_PRSEN_MASK                      0x00000080
#define _PWM1CON_PRSEN_LENGTH                    0x00000001

#define _PWM1CON_PDC0_POSITION                   0x00000000
#define _PWM1CON_PDC0_MASK                       0x00000001
#define _PWM1CON_PDC0_LENGTH                     0x00000001

#define _PWM1CON_PDC1_POSITION                   0x00000001
#define _PWM1CON_PDC1_MASK                       0x00000002
#define _PWM1CON_PDC1_LENGTH                     0x00000001

#define _PWM1CON_PDC2_POSITION                   0x00000002
#define _PWM1CON_PDC2_MASK                       0x00000004
#define _PWM1CON_PDC2_LENGTH                     0x00000001

#define _PWM1CON_PDC3_POSITION                   0x00000003
#define _PWM1CON_PDC3_MASK                       0x00000008
#define _PWM1CON_PDC3_LENGTH                     0x00000001

#define _PWM1CON_PDC4_POSITION                   0x00000004
#define _PWM1CON_PDC4_MASK                       0x00000010
#define _PWM1CON_PDC4_LENGTH                     0x00000001

#define _PWM1CON_PDC5_POSITION                   0x00000005
#define _PWM1CON_PDC5_MASK                       0x00000020
#define _PWM1CON_PDC5_LENGTH                     0x00000001

#define _PWM1CON_PDC6_POSITION                   0x00000006
#define _PWM1CON_PDC6_MASK                       0x00000040
#define _PWM1CON_PDC6_LENGTH                     0x00000001

#define _PWM1CON_P1DC_POSITION                   0x00000000
#define _PWM1CON_P1DC_MASK                       0x0000007F
#define _PWM1CON_P1DC_LENGTH                     0x00000007

#define _PWM1CON_P1RSEN_POSITION                 0x00000007
#define _PWM1CON_P1RSEN_MASK                     0x00000080
#define _PWM1CON_P1RSEN_LENGTH                   0x00000001

#define _PWM1CON_P1DC0_POSITION                  0x00000000
#define _PWM1CON_P1DC0_MASK                      0x00000001
#define _PWM1CON_P1DC0_LENGTH                    0x00000001

#define _PWM1CON_P1DC1_POSITION                  0x00000001
#define _PWM1CON_P1DC1_MASK                      0x00000002
#define _PWM1CON_P1DC1_LENGTH                    0x00000001

#define _PWM1CON_P1DC2_POSITION                  0x00000002
#define _PWM1CON_P1DC2_MASK                      0x00000004
#define _PWM1CON_P1DC2_LENGTH                    0x00000001

#define _PWM1CON_P1DC3_POSITION                  0x00000003
#define _PWM1CON_P1DC3_MASK                      0x00000008
#define _PWM1CON_P1DC3_LENGTH                    0x00000001

#define _PWM1CON_P1DC4_POSITION                  0x00000004
#define _PWM1CON_P1DC4_MASK                      0x00000010
#define _PWM1CON_P1DC4_LENGTH                    0x00000001

#define _PWM1CON_P1DC5_POSITION                  0x00000005
#define _PWM1CON_P1DC5_MASK                      0x00000020
#define _PWM1CON_P1DC5_LENGTH                    0x00000001

#define _PWM1CON_P1DC6_POSITION                  0x00000006
#define _PWM1CON_P1DC6_MASK                      0x00000040
#define _PWM1CON_P1DC6_LENGTH                    0x00000001

#define _ECCP1AS_PSSBD_POSITION                  0x00000000
#define _ECCP1AS_PSSBD_MASK                      0x00000003
#define _ECCP1AS_PSSBD_LENGTH                    0x00000002

#define _ECCP1AS_PSSAC_POSITION                  0x00000002
#define _ECCP1AS_PSSAC_MASK                      0x0000000C
#define _ECCP1AS_PSSAC_LENGTH                    0x00000002

#define _ECCP1AS_ECCPAS_POSITION                 0x00000004
#define _ECCP1AS_ECCPAS_MASK                     0x00000070
#define _ECCP1AS_ECCPAS_LENGTH                   0x00000003

